org/config/installation.org
# -*- org-confirm-babel-evaluate: nil -*-
#+TITLE: Install a Phundrak-flavored Arch Linux
#+INCLUDE: headers.org
#+OPTIONS: auto-id:t
#+HTML_HEAD_EXTRA: <meta name="description" content="Phundrak-flavored Arch Linux" />
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Phundrak-flavored Arch Linux" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="How to install a Phundrak-flavored Arch Linux" />
#+PROPERTY: header-args :exports code :comments link
#+PROPERTY: header-args:python :tangle no

* Table of Contents                                        :TOC_4_gh:noexport:
  :PROPERTIES:
  :CUSTOM_ID: h-400070eb-725f-4416-a4c6-da3053df750b
  :END:

- [[#introduction][Introduction]]
- [[#install-arch-linux][Install Arch Linux]]
  - [[#get-the-latest-live-system-with-fast-mirrors][Get the latest live system with fast mirrors]]
  - [[#install-the-system][Install the system]]
- [[#install-basic-packages][Install basic packages]]
- [[#execute-bootstrap][Execute bootstrap]]
  - [[#decrypt-private-yadm-files][Decrypt private yadm files]]
  - [[#get-a-correct-keyboard-layout][Get a correct keyboard layout]]
  - [[#set-our-locale][Set our locale]]
  - [[#create-some-folders][Create some folders]]
  - [[#set-users-shell-to-fish][Set user’s shell to fish]]
  - [[#install-yay-if-it-isnt-already-installed][Install =yay= if it isn’t already installed]]
  - [[#install-basic-packages-1][Install basic packages]]
  - [[#tangle-configuration-files-from-org-files][Tangle configuration files from Org files]]
  - [[#setting-up-emacs-installing-spacemacs][Setting up Emacs: Installing Spacemacs]]
  - [[#set-up-dotfiles][Set up dotfiles]]
    - [[#update-our-dotfiles-remotes][Update our dotfiles’ remotes]]
    - [[#get-envtpl][Get =envtpl=]]
    - [[#update-our-submodules][Update our submodules]]
  - [[#installing-tryones-compton-fork][Installing Tryone’s Compton fork]]
  - [[#enable-some-of-our-services][Enable some of our services]]
    - [[#docker][Docker]]
    - [[#emacs][Emacs]]
    - [[#ssh-server][SSH server]]
    - [[#ly][Ly]]
    - [[#acpilight][Acpilight]]
    - [[#nordvpn][NordVPN]]
  - [[#symlink-some-system-config-files][Symlink some system config files]]
  - [[#install-packages-from-git][Install packages from git]]
    - [[#polybar-battery][Polybar Battery]]
    - [[#revealjs][Reveal.JS]]
  - [[#install-rust][Install Rust]]
    - [[#install-the-toolchains][Install the toolchains]]
    - [[#install-some-utilities][Install some utilities]]
  - [[#install-some-python-packages][Install some python packages]]
  - [[#install-go-packages][Install go packages]]
  - [[#set-up-chicken-scheme-interpretercompiler][Set up Chicken (Scheme interpreter/compiler)]]
  - [[#clean-the-pacman-and-yay-cache][Clean the =pacman= and =yay= cache]]
  - [[#export-configuration-file-from-org-files][Export configuration file from org files]]
  - [[#set-up-our-fish-shell][Set up our fish shell]]
    - [[#install-fisher][Install =fisher=]]
    - [[#install-our-extensions][Install our extensions]]

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: h-12a4ef6d-13b6-4d1f-9e0f-a060b63b12d4
  :END:
  Here will be  presented what I do to  get my system up and running  on a fresh
  Arch Linux install.  These installation instructions were written  in order to
  get an Arch  Linux distribution up and running with  the same configuration as
  my main computer’s and my travelling laptop’s configuration.

* Install Arch Linux
  :PROPERTIES:
  :CUSTOM_ID: h-cfe21de6-15fa-477a-a5ff-6cd81dfead19
  :END:
  I usually install Arch  from the [[https://www.archlinux.org/download/][vanilla ISO]], however I  began using [[https://github.com/MatMoul/archfi][archfi]] to
  install easily  the distro (I’ve done  it so many  times, I know how  it works
  now). Usually,  my distros will be  installed on at least  two partitions, one
  dedicated to =/home=, the other to the root partition =/=.

  If the computer supports EFI bootloaders, the EFI partition will be mounted on
  =/boot=.  I generally  use rEFInd  as my  boot manager,  but if  you are  more
  comfortable with another one, just install what you want. Be aware that if you
  format your =/boot= partition, you will  delete all boot managers that already
  exist;  so, if  you are  dual-booting, *DO  NOT FORMAT  IT*. Yes,  I made  the
  mistake of wiping the Windows boot manager.

  The swap partition is always at least 4GB  large, and I should have a total of
  12GB of combined RAM  and swap. This means on my main computer  I have 16GB of
  RAM and 4GB of swap, but on my thinkpad I have 4GB of RAM and 8GB of swap.

** Get the latest live system with fast mirrors
   :PROPERTIES:
   :CUSTOM_ID: h-da7951ee-e39a-4a59-a05d-7b7fffdc7825
   :END:
   When you boot into the live ISO, execute the following command:
   #+BEGIN_SRC sh
     pacman -Sy reflector
     reflector -c France -c Germany -l 200 -p http -p https --sort rate \
               --save /etc/pacman.d/mirrorlist --verbose
   #+END_SRC
   This will update the  packages from your live ISO, and you  will get the best
   mirrors for your installation. Of course, change the countries accordingly to
   your location.

** Install the system
   :PROPERTIES:
   :CUSTOM_ID: h-9f9e1fe5-4726-486b-9875-5fcfd91d0bb0
   :END:
   Then you can use a custom script to  ease your installation of Arch if you do
   not wish to do it manually. Personally, I’ve done it several times already, I
   know  how the  distro works,  I just  want to  be able  to install  my distro
   quickly now.
   #+BEGIN_SRC sh
     wget archfi.sf.net/archfi
     # Or from matmoul.github.io/archfi if SourceForge is down
     sh archfi
   #+END_SRC
   Then, follow the instructions and install Arch Linux. Take the opportunity to
   install as many packages as you need,  mainly =yay= which I use as my package
   manager  (it   is  just  a  wrapper   for  =pacman=)  and  AUR   helper,  and
   =pacman-contrib= which will help us installing some packages later.

   Once your system is installed, reboot and remove your installation media from
   your computer.

* Install basic packages
  :PROPERTIES:
  :CUSTOM_ID: h-d2485595-3014-4151-a76c-63bc353359a8
  :END:
  We will need some basic packages in order to run the bootstrap file. So, let’s
  install =fish= (our shell running the script) and =git=.
  #+BEGIN_SRC sh
    yay -Sy fish git yadm
  #+END_SRC

* Execute bootstrap
  :PROPERTIES:
  :CUSTOM_ID: h-c13d132f-9e69-4bb0-838b-29c7c5611f11
  :HEADER-ARGS: :tangle ~/.config/yadm/bootstrap
  :HEADER-ARGS:python: :tangle no
  :END:
  =yadm=  comes with  a very  handy  feature: its  bootstrap script.  It can  be
  executed automatically once the dotfiles are cloned with yadm:
  #+BEGIN_SRC fish :tangle no
    yadm clone https://labs.phundrak.com/phundrak/dotfiles
    # or if labs.phundrak.com is down or too slow for you
    yadm clone https://github.com/phundrak/dotfiles
  #+END_SRC

  Notice these two header files, we can see  this is a fish script, hence why we
  need fish (which is my daily shell anyway).
  #+BEGIN_SRC fish
    #!/usr/bin/fish
    # -*- mode: fish -*-
  #+END_SRC
  Let’s take a look at what it does.

** Decrypt private yadm files
   :PROPERTIES:
   :CUSTOM_ID: h-2ce7e756-3dab-4c12-a3b3-d1b6f8d4805d
   :END:
   Some  private  files are  stored  encrypted  in  the  repository of  my  yadm
   dotfiles. I will need them later on during the bootstrap execution.
   #+BEGIN_SRC fish
   yadm decrypt
   #+END_SRC

** Get a correct keyboard layout
   :PROPERTIES:
   :CUSTOM_ID: h-89fb8f3a-6ec4-4701-a5d9-3e593c47ece9
   :END:
   I use  mainly the [[https://bepo.fr/wiki/Accueil][bépo]]  layout, a French  keyboard layout inspired  by Dvorak
   layouts,  however I  sometimes need  to switch  back to  the standard  French
   AZERTY or the American  QWERTY layout, so I make it so  the Menu key switches
   for me my layout between these three.  This makes it so my xorg configuration
   of my keyboard looks like this:
   #+BEGIN_SRC fish
     set keyboardconf \
     'Section "InputClass"
             Identifier "system-keyboard"
             MatchIsKeyboard "on"
             Option "XkbLayout" "fr,fr,us"
             Option "XkbModel" "pc104"
             Option "XkbVariant" "bepo,,"
             Option "XkbOptions" "grp:menu_toggle"
     EndSection'
   #+END_SRC
   So, let’s set it as our keyboard configuration.
   #+BEGIN_SRC fish
     printf "\n# Set keyboard layout #########################################################\n\n"
     echo $keyboardconf | sudo tee /etc/X11/xorg.conf.d/00-keyboard.conf
   #+END_SRC

** Set our locale
   :PROPERTIES:
   :CUSTOM_ID: h-48678405-93ae-41b6-b44b-285ab0da4e92
   :END:
   I use two main  locales, the French and US UTF-8 locales, and  I like to keep
   the Japanese locale activated just in case.
   #+BEGIN_SRC fish
     set mylocales "en_US.UTF-8 UTF-8" "fr_FR.UTF-8 UTF-8" "ja_JP.UTF-8 UTF-8"
   #+END_SRC
   Let’s enable these.
   #+BEGIN_SRC fish
     printf "\n# Set our locale ##############################################################\n\n"
     for item in $mylocales
         if test (grep -e "#$item" /etc/locale.gen)
             sudo sed -i "/$item/s/^#//g" /etc/locale.gen
         end
     end
   #+END_SRC

   This is my configuration I usually use when it comes to my locale.
   #+BEGIN_SRC fish
     set localeconf "LANG=en_US.UTF-8
     LC_COLLATE=C
     LC_NAME=fr_FR.UTF-8
     LC_NUMERIC=fr_FR.UTF-8
     LC_IDENTIFICATION=fr_FR.UTF-8
     LC_TELEPHONE=fr_FR.UTF-8
     LC_MONETARY=fr_FR.UTF-8
     LC_PAPER=fr_FR.UTF-8
     LC_ADDRESS=fr_FR.UTF-8
     LC_TIME=fr_FR.UTF-8
     LC_MEASUREMENT=fr_FR.UTF-8"
   #+END_SRC
   Let’s set it as our system’s locale.
   #+BEGIN_SRC fish
     echo $localeconf | sudo tee /etc/locale.conf
   #+END_SRC
   Now we can generate our locale!
   #+BEGIN_SRC fish
     printf "\n# Generate locale #############################################################\n\n"
     sudo locale-gen
   #+END_SRC

** Create some folders
   :PROPERTIES:
   :CUSTOM_ID: h-85ce90ff-56dc-469b-bf08-480ecf27acc4
   :END:
   Let’s create  some folders  we might  need for  mounting our  drives, Android
   devices and CDs.
   #+BEGIN_SRC fish
     printf "\n# Create directories for mounting #############################################\n\n"
     sudo mkdir -p /mnt/{USB,CD,Android}
     sudo chown $USER:(id -g $USER) /mnt/{USB,CD,Android}
   #+END_SRC

   We also need the following folder for our nano backups.
   #+BEGIN_SRC fish
     mkdir -p $HOME/.cache/nano/backups
   #+END_SRC

** Set user’s shell to fish
   :PROPERTIES:
   :CUSTOM_ID: h-c1a78394-c156-4a03-ae82-e5e9d4090dab
   :END:
   First of all, the bootstrap shell will set the user’s shell to fish.
   #+BEGIN_SRC fish
     printf "\n# Set fish as the default shell ###############################################\n\n"
     if not test "$SHELL" = "/usr/bin/fish"
         chsh -s /usr/bin/fish
     end
   #+END_SRC

** Install =yay= if it isn’t already installed
   :PROPERTIES:
   :CUSTOM_ID: h-fef57cea-cf1d-4900-9d90-ec6353ea9661
   :END:
   Now we’ll need to be sure =yay=,  our AUR helper, is installed on our system.
   If it is, we  don’t need to to anything. However, if  it isn’t, we’ll install
   it manually.
   #+BEGIN_SRC fish
     if ! test (which yay)
         printf "\n# Installing yay ##############################################################\n\n"
         cd
         mkdir -p ~/fromGIT
         cd ~/fromGIT
         git clone https://aur.archlinux.org/yay.git
         cd yay
         makepkg -si --noconfirm
     else
         printf "\n# yay already installed #######################################################\n\n"
     end
   #+END_SRC

