org/config/installation.org
** Install basic packages
   :PROPERTIES:
   :CUSTOM_ID: h-887ec6d4-535d-4363-a0a7-884717b87a47
   :END:
   Let’s set in a custom varible what packages we’ll be needing.
   #+BEGIN_SRC fish
     set PACKAGES \
     acpilight adobe-source-han-sans-jp-fonts asar ascii aspell-en aspell-fr assimp \
     awesome-terminal-fonts base-devel bat biber bleachbit bluez-firmware \
     bluez-utils bookworm boost bzip2 ccls chicken chromium clisp compton cppcheck \
     cppreference cppreference-devhelp cpupower cronie cryptsetup device-mapper \
     diffutils discord-canary discount ditaa dmenu dmenu-lpass docker \
     docker-compose dockerfile-language-server-bin doxygen dunst dwarffortress \
     emacs exfat-utils farbfeld feh ffmpegthumbnailer findutils firefox flake8 \
     font-mathematica fontforge freeglut fzf gcc-libs gdb gimp glibc \
     gnome-disk-utility gnome-epub-thumbnailer gnu-free-fonts gnuplot go-tools \
     golangci-lint-bin graphviz htop i3-gaps-rounded-git i3lock-blur i3status \
     igdm-bin inetutils j4-dmenu-desktop javascript-typescript-langserver \
     js-beautify jfsutils jmtpfs lastpass-cli less linux-headers lldb logrotate \
     lvm2 ly meson minted mpc mpd mpd-rich-presence-discord-git mpv mupdf-tools \
     nano ncdu ncmpcpp nemo-fileroller nemo-preview neofetch neovim netctl \
     networkmanager networkmanager-openvpn nm-connection-editor nnn nodejs-vmd \
     nomacs nordvpn-bin noto-fonts-emoji npm ntfs-3g numlockx openssh otf-fandol \
     otf-ipafont p7zip pacman-contrib pandoc-bin pavucontrol pciutils pcurses pdfpc \
     polybar prettier pulseaudio-bluetooth python-autoflake python-envtpl-git \
     python-epc python-importmagic python-language-server python-nose python-pip \
     python-ptvsd python-pytest python-pywal qt5-imageformats qemu r \
     raw-thumbnailer redshift reflector rofi rofi-wifi-menu-git rsync rtv rustup \
     s-nail samba scrot sent shadow siji-git simplescreenrecorder speedcrunch sshfs \
     st-luke-git swi-prolog texlive-bin texlive-langchinese texlive-langcyrillic \
     texlive-langgreek texlive-langjapanese texlive-langkorean texlive-latexextra \
     texlive-localmanager-git texlive-most tmux tree ttf-arphic-uming ttf-baekmuk \
     ttf-bitstream-vera ttf-dejavu ttf-google-fonts-opinionated-git ttf-hanazono \
     ttf-joypixels ttf-koruri ttf-liberation ttf-material-design-icons-git \
     ttf-monapo ttf-mplus ttf-ms-fonts ttf-sazanami ttf-symbola ttf-tibetan-machine \
     ttf-twemoji-color ttf-unifont ttf-vlgothic typescript \
     typescript-language-server-bin unicode unicode-emoji unrar usbutils valgrind \
     vscode-css-languageserver-bin vscode-html-languageserver-bin w3m wget \
     x11-ssh-askpass xclip xdg-user-dirs-gtk xfsprogs xorg-apps xorg-drivers \
     xorg-server xorg-xinit xss-lock xvkbd yaml-language-server-bin yapf
   #+END_SRC
   These are the  minimum I would have  in my own installation. You  can edit it
   however you want. Let’s install those.
   #+BEGIN_SRC fish
     printf "\n# Installing needed packages ##################################################\n\n"
     sudo pacman -Syu
     yay -S --needed $PACKAGES
   #+END_SRC

** Tangle configuration files from Org files
   :PROPERTIES:
   :CUSTOM_ID: h-2e4fe0f5-a507-44c5-b69f-1935868b909d
   :END:
   The next step is  to tangle all the Org files. Here is the list of files that
   are to be tangled:
   #+NAME: tangled-files
   | filename      |
   |---------------|
   | bin.org       |
   | fish.org      |
   | i3.org        |
   | index.org     |
   | nano.org      |
   | polybar.org   |
   | spacemacs.org |
   | tmux.org      |

   #+NAME: generate-tangle
   #+BEGIN_SRC python :exports none :var files=tangled-files[,0] :cache yes
     result = ''
     commandPrintf = 'printf "\\n\\n==== Tangling {0}\\n\\n"\n'
     commandEmacs = 'emacs -q --batch --eval "(require \'ob-tangle)" --eval "(setq org-confirm-babel-evaluate nil)" --eval "(org-babel-do-load-languages \'org-babel-load-languages \'((python . t)))" --eval "(org-babel-tangle-file \\"~/org/config/{0}\\")"\n'
     for file in files:
         result += commandPrintf.format(file) + commandEmacs.format(file)
     return result
   #+END_SRC

   #+RESULTS[5f4c0ff55361ff7899541accb58b11496124e376]: generate-tangle
   #+begin_example
   printf "\n\n==== Tangling bin.org\n\n"
   emacs -q --batch --eval "(require 'ob-tangle)" --eval "(setq org-confirm-babel-evaluate nil)" --eval "(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))" --eval "(org-babel-tangle-file \"~/org/config/bin.org\")"
   printf "\n\n==== Tangling fish.org\n\n"
   emacs -q --batch --eval "(require 'ob-tangle)" --eval "(setq org-confirm-babel-evaluate nil)" --eval "(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))" --eval "(org-babel-tangle-file \"~/org/config/fish.org\")"
   printf "\n\n==== Tangling i3.org\n\n"
   emacs -q --batch --eval "(require 'ob-tangle)" --eval "(setq org-confirm-babel-evaluate nil)" --eval "(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))" --eval "(org-babel-tangle-file \"~/org/config/i3.org\")"
   printf "\n\n==== Tangling index.org\n\n"
   emacs -q --batch --eval "(require 'ob-tangle)" --eval "(setq org-confirm-babel-evaluate nil)" --eval "(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))" --eval "(org-babel-tangle-file \"~/org/config/index.org\")"
   printf "\n\n==== Tangling nano.org\n\n"
   emacs -q --batch --eval "(require 'ob-tangle)" --eval "(setq org-confirm-babel-evaluate nil)" --eval "(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))" --eval "(org-babel-tangle-file \"~/org/config/nano.org\")"
   printf "\n\n==== Tangling polybar.org\n\n"
   emacs -q --batch --eval "(require 'ob-tangle)" --eval "(setq org-confirm-babel-evaluate nil)" --eval "(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))" --eval "(org-babel-tangle-file \"~/org/config/polybar.org\")"
   printf "\n\n==== Tangling spacemacs.org\n\n"
   emacs -q --batch --eval "(require 'ob-tangle)" --eval "(setq org-confirm-babel-evaluate nil)" --eval "(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))" --eval "(org-babel-tangle-file \"~/org/config/spacemacs.org\")"
   printf "\n\n==== Tangling tmux.org\n\n"
   emacs -q --batch --eval "(require 'ob-tangle)" --eval "(setq org-confirm-babel-evaluate nil)" --eval "(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))" --eval "(org-babel-tangle-file \"~/org/config/tmux.org\")"
   #+end_example

   #+BEGIN_SRC fish :noweb yes
     printf "\n# Tangling org files ##########################################################\n\n"
     <<generate-tangle()>>
   #+END_SRC

   Let’s also make  sure the exported files that are  supposed to be executables
   are indeed executables.
   #+BEGIN_SRC fish
     find ~/.local/bin -type f -exec chmod +x {} +
   #+END_SRC

** Setting up Emacs: Installing Spacemacs
   :PROPERTIES:
   :CUSTOM_ID: h-bd5a92c4-1a4f-49ea-a447-050a4ff0301c
   :END:
   Now,  the first  thing we  want to  do with  Emacs is  install its  Spacemacs
   distribution.  We’ll clone  its =develop=  branch into  =~/.config/emacs=. We
   need to  do this prior  to our dotfiles’  cloning because of  some submodules
   that are cloned within our =~/.config/emacs=  directory, and git won’t let us
   clone Spacemacs in an already existing  and non-empty directory. To make sure
   it  isn’t  one,  let’s  delete  any  potentially  existing  =~/.config/emacs=
   directory:
   #+BEGIN_SRC fish
     printf "\n# Installing Spacemacs ########################################################\n\n"
     rm -rf ~/.config/emacs
   #+END_SRC
   Now we can clone Spacemacs:
   #+BEGIN_SRC fish
     git clone --single-branch --branch develop https://github.com/syl20bnr/spacemacs ~/.config/emacs
   #+END_SRC
   And we can  restore what might have been deleted  in our =~/.emacs.d/private=
   directory:
   #+BEGIN_SRC fish
     yadm checkout -- ~/.config/emacs/private/
   #+END_SRC

** Set up dotfiles
   :PROPERTIES:
   :CUSTOM_ID: h-cf2c3a24-b08e-4b07-9d51-31f6df781e62
   :END:
*** Update our dotfiles’ remotes
    :PROPERTIES:
    :CUSTOM_ID: h-18967335-2637-44d6-b407-bb1d2d2718b9
    :END:
    This line in the bootstrap script will  test if the current user is using my
    username. If yes, it’s probably me.
    #+BEGIN_SRC fish
      if ! test (echo "phundrak" | sed -e "s/^.*$USER//I")
    #+END_SRC
    If it is  me installing and using  these dotfiles, I want the  remotes of my
    dotfiles to be set to ssh remotes using my ssh keys.
    #+BEGIN_SRC fish
      printf "\n# Update yadm’s remotes #######################################################\n\n"
      yadm remote set-url origin git@labs.phundrak.com:phundrak/dotfiles.git
      yadm remote add github git@github.com:phundrak/dotfiles.git
    #+END_SRC
    I will also want to decrypt my encrypted files, such as said ssh keys.
    #+BEGIN_SRC fish
      printf "\n# Decrypt encrypted dotfiles ##################################################\n\n"
      yadm decrypt
    #+END_SRC
    Finally, let’s close this =if= statement.
    #+BEGIN_SRC fish
      end
    #+END_SRC

