org/config/installation.org
*** Get =envtpl=
    :PROPERTIES:
    :CUSTOM_ID: h-39034878-7864-4a1c-855d-d9882795aac0
    :END:
    Before  we set  our  dotfiles  up, let’s  make  sure  =envtpl= is  correctly
    installed. This package will be needed for generating our alt dotfiles.
    #+BEGIN_SRC fish
      printf '\n# Install envtpl ##############################################################\n\n'
      yay -Syu --needed python-envtpl-git
    #+END_SRC

*** Update our submodules
    :PROPERTIES:
    :CUSTOM_ID: h-ae2f8ccb-a8f3-4699-832c-52cbc8b6d081
    :END:
    Now we  can download  the various  dependencies of our  dotfiles. To  do so,
    let’s run the following command:
    #+BEGIN_SRC fish
      printf "\n# Getting yadm susbmodules ####################################################\n\n"
      yadm submodule update --init --recursive
    #+END_SRC

** Installing Tryone’s Compton fork
   :PROPERTIES:
   :CUSTOM_ID: h-aecf9f01-268c-40cd-8fc3-622c6ce822e4
   :END:
   For some reason, I  found installing directly this fork does  not work, and I
   need  to  install  it  after   I  installed  the  regular  compton  packages.
   =compton-tryone-git= will replace =compton= which will be removed.
   #+BEGIN_SRC fish
     printf "\n# Installing tryone’s compton fork ############################################\n\n"
     yay -S --needed compton-tryone-git
   #+END_SRC

** Enable some of our services
   :PROPERTIES:
   :CUSTOM_ID: h-1044da09-e992-4dcb-90ff-513725e1d450
   :END:
   We have  installed some packages  which require  some services to  run. Let’s
   enable them.

*** Docker
    :PROPERTIES:
    :CUSTOM_ID: h-429cb31a-fccb-420f-a5aa-21054c45fb38
    :END:
    First, let’s activate Docker.
    #+BEGIN_SRC fish
      printf "\n# Enabling and starting Docker ################################################\n\n"
      sudo systemctl enable --now docker
    #+END_SRC

    Now, if we wish  it, we can be added to the =docker=  group so we won’t have
    to type =sudo= each time we call Docker or Docker Compose.
    #+BEGIN_SRC fish
      read --prompt "echo 'Do you wish to be added to the `docker` group? (Y/n): ' " -l adddockergroup
      if test $adddockergroup = 'y' || test $adddockergroup = "Y" || test $adddockergroup = ''
          sudo usermod -aG docker $USER
      end
    #+END_SRC

*** Emacs
    :PROPERTIES:
    :CUSTOM_ID: h-7131fa13-3c6e-4cfc-b8e8-c880de9d380f
    :END:
    Emacs will run as a user service,  which means it won’t be launched until we
    log in.
    #+BEGIN_SRC fish
      printf "\n# Enabling Emacs as user service ##############################################\n\n"
      systemctl --user enable --now emacs
    #+END_SRC

*** SSH server
    :PROPERTIES:
    :CUSTOM_ID: h-1f355779-f1dc-4c0f-9cf1-14724ce05f4d
    :END:
    Maybe we want to activate an SSH server on our machine. If so, we can enable
    it. Let’s ask the question.
    #+BEGIN_SRC fish
      read --prompt "echo 'Do you want to activate the ssh server? (Y/n): ' " -l sshdserver
      if test $sshdserver = 'y' || test $sshdserver = "Y" || test $sshdserver = ''
          printf "\n# Enabling ssh server #########################################################\n\n"
          sudo systemctl enable --now sshd
      end
    #+END_SRC

*** Ly
    :PROPERTIES:
    :CUSTOM_ID: h-2785fc5b-cd35-4c99-9f47-3dcbf1a7a870
    :END:
    Ly is a display manager based on ncurses  which I find nice enough for me to
    use (I  generally don’t like using  display managers). Let’s enable  it, and
    let’s disable tty2 while we’re at it (Ly uses it to run X).
    #+BEGIN_SRC fish
      sudo systemctl enable --now ly
      sudo systemctl disable getty@tty2
    #+END_SRC

*** Acpilight
    :PROPERTIES:
    :CUSTOM_ID: h-5423e2a7-d2ce-4bc3-9d5d-85677c18181e
    :END:
    =acpilight= is our  utility managing the brightness of our  screen. There is
    actually no service to  enable here, but we must ensure the  user is part of
    the =video=  group so  we can  modify the brightness  of our  screen without
    using =sudo=.
    #+BEGIN_SRC fish
      sudo usermod -aG video $USER
    #+END_SRC

*** NordVPN
    :PROPERTIES:
    :CUSTOM_ID: h-49c24a3e-a496-4200-bf64-96e945c203a0
    :END:
    Thanks  to the  AUR  package ~nordvpn-bin~,  I no  longer  have to  manually
    maintain my  VPN connections manually  with OpenVPN. However, it  requires a
    service that we should activate:
    #+BEGIN_SRC fish
    sudo systemctl enable --now nordvpnd
    #+END_SRC

** Symlink some system config files
   :PROPERTIES:
   :CUSTOM_ID: h-b14d7d03-da49-4a7b-ba05-1c0848bd8e44
   :END:
   We have some files in [[file:ect/][etc/]] that are to be symlinked to =/etc=.
   #+BEGIN_SRC fish
     for f in (find ~/.etc -type f)
         set dest (echo $f | sed -n 's/^.*etc\(.*\)$/\/etc\1/p')
         sudo ln -s $f $dest
     end
   #+END_SRC

   We may also want  to symlink our [[file:.nanorc][nanorc]] to the =/root=  directory for when we
   use =nano= as =sudo=.
   #+BEGIN_SRC fish
     read --prompt "echo 'Symlink .nanorc to root’s .nanorc? (Y/n): ' " -l nanoroot
     if test $nanoroot = 'y' || test $nanoroot = "Y" || test $nanoroot = ''
         printf "\n# Symlinking .nanorc to root’s .nanorc ########################################\n\n"
         sudo ln -s $HOME/.nanorc /root/.nanorc
     end
   #+END_SRC

** Install packages from git
   :PROPERTIES:
   :CUSTOM_ID: h-e79da7b2-9286-4b66-812e-453e3b2505c7
   :END:
   Now, let’s install some packages from git directly.
   #+BEGIN_SRC fish
     mkdir -p ~/fromGIT
   #+END_SRC

*** Polybar Battery
    :PROPERTIES:
    :CUSTOM_ID: h-f228ec52-a7d0-4c16-adfa-75c544fcfa93
    :END:
    Now let’s install =polybar-battery=. This is a binary that I’ll use in my [[file:.config/i3/config][i3
    config]] to  indicate my battery  level. It also  sends a notification  on low
    battery and on charging completed.
    #+BEGIN_SRC fish
      printf "\n# Install polybar-battery #####################################################\n\n"
      cd ~/fromGIT
      git clone https://github.com/drdeimos/polybar_another_battery.git
      cd polybar_another_battery
      go get -u github.com/distatus/battery/cmd/battery
      make build
    #+END_SRC

    Now, we  have our binary,  let’s symlink it  in our local  binary directory,
    =~/.local/bin=.
    #+BEGIN_SRC fish
      ln -s polybar-ab ~/.local/bin/polybar-ab
    #+END_SRC

*** Reveal.JS
    :PROPERTIES:
    :CUSTOM_ID: h-68d1cdb4-1447-420f-ab0c-53ef905e757b
    :END:
    I sometimes use  Reveal.JS to make presentations, and I  set its location in
    my [[file:.spacemacs][dotspacemacs]] file to be in =~/fromGIT=, so let’s clone it there.
    #+BEGIN_SRC fish
      printf "\n# Install Reveal.JS ###########################################################\n\n"
      cd ~/fromGIT
      git clone https://github.com/hakimel/reveal.js.git
    #+END_SRC

** Install Rust
   :PROPERTIES:
   :CUSTOM_ID: h-57e8af4c-93f2-4145-9c39-a5f8d1c9f012
   :END:
*** Install the toolchains
    :PROPERTIES:
    :CUSTOM_ID: h-05ee25dc-3885-46ca-afaf-35bfb2e385d4
    :END:
    When using rust, I bounce between two toolchains, the =stable= toolchain and
    the =nightly=  toolchain. To  install them,  I will  use =rustup=  which has
    already been installed.
    #+BEGIN_SRC fish
      printf "\n# Install the rust toolchains, nightly is the default one #####################\n\n"
      rustup default nightly
    #+END_SRC
    This will both download the nightly toolchain and set it as the default one.
    Yup, I like to live dangerously.  Now to install the stable toolchain, let’s
    run this:
    #+BEGIN_SRC fish
      rustup toolchain install stable
    #+END_SRC

*** Install some utilities
    :PROPERTIES:
    :CUSTOM_ID: h-f94f2e18-623f-4aa5-be99-6a7df6a9cbcd
    :END:
    We’ll need some utilities when  developing Rust from Emacs, namely =rustfmt=
    and =racer=. Let’s install them with =cargo=.
    #+BEGIN_SRC fish
      printf "\n# Add rust utilities ##########################################################\n\n"
      cargo install rustfmt racer
    #+END_SRC

    We will also need some components for development purposes:
    #+BEGIN_SRC fish
      rustup component add src
      rustup component add rls
    #+END_SRC

** Install some python packages
   :PROPERTIES:
   :CUSTOM_ID: h-8155ae1a-0be1-489f-be13-9222f7686fb2
   :END:
   Some  packages will  be needed  from  pip in  order  to get  our Emacs  setup
   correctly working. Let’s install them locally for our user:
   #+BEGIN_SRC fish
     printf "\n# Installing Python packages ##################################################\n\n"
     pip install --user pyls-isort pyls-mypy
   #+END_SRC

