.config/yadm/bootstrap
# Update our dotfiles’ remotes:3 ends here

# [[file:~/org/config/installation.org::*Update our dotfiles’ remotes][Update our dotfiles’ remotes:4]]
end
# Update our dotfiles’ remotes:4 ends here

# [[file:~/org/config/installation.org::*Get =envtpl=][Get =envtpl=:1]]
printf '\n# Install envtpl ##############################################################\n\n'
yay -Syu python-envtpl-git
# Get =envtpl=:1 ends here

# [[file:~/org/config/installation.org::*Update our submodules][Update our submodules:1]]
printf "\n# Getting yadm susbmodules ####################################################\n\n"
yadm submodule update --init --recursive
# Update our submodules:1 ends here

# [[file:~/org/config/installation.org::*Generate our alt files][Generate our alt files:1]]
printf "\n# Generating alt files ########################################################\n\n"
yadm alt
# Generate our alt files:1 ends here

# [[file:~/org/config/installation.org::*Installing Tryone’s Compton fork][Installing Tryone’s Compton fork:1]]
printf "\n# Installing tryone’s compton fork ############################################\n\n"
yay -S compton-tryone-git
# Installing Tryone’s Compton fork:1 ends here

# [[file:~/org/config/installation.org::*Docker][Docker:1]]
printf "\n# Enabling and starting Docker ################################################\n\n"
sudo systemctl enable --now docker
# Docker:1 ends here

# [[file:~/org/config/installation.org::*Docker][Docker:2]]
read --prompt "echo 'Do you wish to be added to the `docker` group? (Y/n): ' " -l adddockergroup
if test $adddockergroup = 'y' || test $adddockergroup = "Y" || test $adddockergroup = ''
    sudo usermod -aG docker $USER
end
# Docker:2 ends here

# [[file:~/org/config/installation.org::*Emacs][Emacs:1]]
printf "\n# Enabling Emacs as user service ##############################################\n\n"
systemctl --user enable --now emacs
# Emacs:1 ends here

# [[file:~/org/config/installation.org::*SSH server][SSH server:1]]
read --prompt "echo 'Do you want to activate the ssh server? (Y/n): ' " -l sshdserver
if test $sshdserver = 'y' || test $sshdserver = "Y" || test $sshdserver = ''
    printf "\n# Enabling ssh server #########################################################\n\n"
    sudo systemctl enable --now sshd
end
# SSH server:1 ends here

# [[file:~/org/config/installation.org::*Ly][Ly:1]]
sudo systemctl enable --now ly
sudo systemctl disable getty@tty2
# Ly:1 ends here

# [[file:~/org/config/installation.org::*Acpilight][Acpilight:1]]
sudo usermod -aG video $USER
# Acpilight:1 ends here

# [[file:~/org/config/installation.org::*NordVPN][NordVPN:1]]
sudo systemctl enable --now nordvpnd
# NordVPN:1 ends here

# [[file:~/org/config/installation.org::*Symlink some system config files][Symlink some system config files:1]]
for f in (find ~/.etc -type f)
    set dest (echo $f | sed -n 's/^.*etc\(.*\)$/\/etc\1/p')
    sudo ln -s $f $dest
end
# Symlink some system config files:1 ends here

# [[file:~/org/config/installation.org::*Symlink some system config files][Symlink some system config files:2]]
read --prompt "echo 'Symlink .nanorc to root’s .nanorc? (Y/n): ' " -l nanoroot
if test $nanoroot = 'y' || test $nanoroot = "Y" || test $nanoroot = ''
    printf "\n# Symlinking .nanorc to root’s .nanorc ########################################\n\n"
    sudo ln -s $HOME/.nanorc /root/.nanorc
end
# Symlink some system config files:2 ends here

# [[file:~/org/config/installation.org::*Polybar Battery][Polybar Battery:1]]
printf "\n# Install polybar-battery #####################################################\n\n"
cd ~/fromGIT
git clone https://github.com/drdeimos/polybar_another_battery.git
cd polybar_another_battery
go get -u github.com/distatus/battery/cmd/battery
make build
# Polybar Battery:1 ends here

# [[file:~/org/config/installation.org::*Polybar Battery][Polybar Battery:2]]
ln -s polybar-ab ~/.local/bin/polybar-ab
# Polybar Battery:2 ends here

# [[file:~/org/config/installation.org::*Reveal.JS][Reveal.JS:1]]
printf "\n# Install Reveal.JS ###########################################################\n\n"
cd ~/fromGIT
git clone https://github.com/hakimel/reveal.js.git
# Reveal.JS:1 ends here

# [[file:~/org/config/installation.org::*Install the toolchains][Install the toolchains:1]]
printf "\n# Install the rust toolchains, nightly is the default one #####################\n\n"
rustup default nightly
# Install the toolchains:1 ends here

# [[file:~/org/config/installation.org::*Install the toolchains][Install the toolchains:2]]
rustup toolchain install stable
# Install the toolchains:2 ends here

# [[file:~/org/config/installation.org::*Install some utilities][Install some utilities:1]]
printf "\n# Add rust utilities ##########################################################\n\n"
cargo install rustfmt racer
# Install some utilities:1 ends here

# [[file:~/org/config/installation.org::*Install some utilities][Install some utilities:2]]
rustup component add src
rustup component add rls
# Install some utilities:2 ends here

# [[file:~/org/config/installation.org::*Install some python packages][Install some python packages:1]]
printf "\n# Installing Python packages ##################################################\n\n"
pip install --user pyls-isort pyls-mypy
