org/config/installation.org
** Install go packages
   :PROPERTIES:
   :CUSTOM_ID: h-8c6e2311-eb84-4bf4-8e0b-948f89bc9664
   :END:
   For go development from Emacs, the  Spacemacs go and lsp layers requires some
   packages to be installed.
   #+BEGIN_SRC fish
     printf "\n# Installing Go packages ######################################################\n\n"
     go get -v golang.org/x/tools/gopls@latest
     go get -u -v golang.org/x/tools/cmd/godoc
     go get -u -v golang.org/x/tools/cmd/goimports
     go get -u -v golang.org/x/tools/cmd/gorename
     go get -u -v golang.org/x/tools/cmd/guru
     go get -u -v github.com/cweill/gotests/...
     go get -u -v github.com/davidrjenni/reftools/cmd/fillstruct
     go get -u -v github.com/fatih/gomodifytags
     go get -u -v github.com/godoctor/godoctor
     go get -u -v github.com/golangci/golangci-lint/cmd/golangci-lint
     go get -u -v github.com/haya14busa/gopkgs/cmd/gopkgs
     go get -u -v github.com/josharian/impl
     go get -u -v github.com/mdempsky/gocode
     go get -u -v github.com/rogpeppe/godef
     go get -u -v github.com/zmb3/gogetdoc
     go get -u -v golang.org/x/tools/gopls
   #+END_SRC

** Set up Chicken (Scheme interpreter/compiler)
   :PROPERTIES:
   :CUSTOM_ID: h-10ffb0c0-8028-4e9c-842e-9e7d2c165c5b
   :END:
   Chicken needs to be  set up before being used. First, we  need to install its
   documentation.
   #+BEGIN_SRC fish
     printf "\n# Setting up Chicken ##########################################################\n\n"
     chicken-install -s apropos chicken-doc
   #+END_SRC

   Then, we’ll complete the documentation like so:
   #+BEGIN_SRC fish
     cd (chicken-csi -b -e "(import (chicken platform))" -p "(chicken-home)")
     curl https://3e8.org/pub/chicken-doc/chicken-doc-repo.tgz | sudo tar zx
   #+END_SRC

** Clean the =pacman= and =yay= cache
   :PROPERTIES:
   :CUSTOM_ID: h-fa5307ec-065b-4d06-9d47-05ccde0da8ac
   :END:
   Finally, we are almost done! Let’s clean the cache of =pacman= and =yay=.
   #+BEGIN_SRC fish
     printf "\n# Clean the pacman and yay cache ##############################################\n\n"
     yay -Sc --noconfirm
   #+END_SRC

** Export configuration file from org files
   :PROPERTIES:
   :CUSTOM_ID: h-a4fb171a-3121-46f2-8c3c-2e65500ebdbe
   :END:
   As I strive to write most of my configuration file as literary programming
   files through org-mode, they are not versioned nor downloaded by git when
   cloning my dotfiles. This is why

** Set up our fish shell
   :PROPERTIES:
   :CUSTOM_ID: h-f6f4df67-b0de-40bf-95fb-888d42169088
   :END:
   The last thing we want to do is to set up our fish shell with some extensions
   in order to improve the user experience.

*** Install =fisher=
    :PROPERTIES:
    :CUSTOM_ID: h-d6490ddc-c909-4713-b36a-19c25a79c7ac
    :END:
    We will be using =fisher= as  our extensions manager for Fish. Let’s install
    it.
    #+BEGIN_SRC fish
      printf "\n# Installing fisher ###########################################################\n\n"
      curl https://git.io/fisher --create-dirs -sLo ~/.config/fish/functions/fisher.fish
    #+END_SRC

*** Install our extensions
    :PROPERTIES:
    :CUSTOM_ID: h-3d540273-bdfb-4c63-a05f-2374a010dc29
    :END:
    I generally use the following extensions in my Fish shell.
    #+NAME: fish-extensions
    #+CAPTION: Fish extensions managed by Fisher
    | Package name                | Description                                                      |
    |-----------------------------+------------------------------------------------------------------|
    | oh-my-fish/theme-bobthefish | Robust, git-aware, powerline prompt                              |
    | jorgebucaran/fish-bax       | Run bash scripts, replaying environment changes in fish          |
    | franciscolourenco/done      | Automatically receive notifications when a long process finishes |
    | jethrokuan/fzf              | Improved key bindings for [[https://github.com/junegunn/fzf][junegunn/fzf]]                           |
    | jethrokuan/z                | Pure-fish [[https://github.com/rupa/z][rupa/z]]-like directory jumping                          |
    | jorgebucaran/fish-getopts   | CLI options parser; alternative to the [[https://fishshell.com/docs/current/commands.html#argparse][argparse]] fish builtin     |
    | laughedelic/pisces          | Autoclose parentheses, braces, quotes and other paired symbols   |
    | tuvistavie/fish-ssh-agent   | Utility functions to start your ssh agent                        |
    | acomagu/fish-async-prompt   | Make your prompt asynchronous to increase it reactivity          |

    #+NAME: fish-ext-py
    #+BEGIN_SRC python :exports none :tangle no :var extensions=fish-extensions :cache yes
      results = ''
      for extension in extensions:
          results += "fisher add {0}\n".format(extension[0])
      return results
    #+END_SRC

    #+RESULTS[e82c7269c09b1d43a1a335a13c422b22b59079b1]: fish-ext-py
    : fisher add oh-my-fish/theme-bobthefish
    : fisher add jorgebucaran/fish-bax
    : fisher add franciscolourenco/done
    : fisher add jethrokuan/fzf
    : fisher add jethrokuan/z
    : fisher add jorgebucaran/fish-getopts
    : fisher add laughedelic/pisces
    : fisher add tuvistavie/fish-ssh-agent
    : fisher add acomagu/fish-async-prompt

    #+BEGIN_SRC fish :noweb yes
      printf "\n# Installing Fisher Extensions ################################################\n\n"
      <<fish-ext-py()>>
    #+END_SRC
